# 储存基金公司定期发送的净值excel的模板信息

# 荣熙明心一号模板
templete_rongxi = {'file_name' : '荣熙明心',
            'fund_id': [695],
            'date' : '净值日期',
            'nv' : '单位净值',
            'anv': '累计单位净值',
            'header': 0}

# 潼骁产品模板
templete_tongxiao = {'file_name' : '潼骁产品净值数据',
            'fund_id': [781, 763, 778, 753, 752, 782, 761, 762, 787, 760, 786, 785, 754, 768, 758, 780, 779, 783, 755, 776, 756, 770, 769, 771, 774, 775, 777, 757, 764, 765, 766, 767, 772, 773, 759, 784],
            'date' : '净值日期',
            'nv' : '单位净值',
            'anv': '累计净值',
            'header': 0}


# 致远产品模板 -1对应无效sheet
templete_zhiyuan = {'file_name' : '致远',
            'fund_id': [-1, -1, -1, 31, 30, 32, 33, 34, 29],
            'date' : '净值日期',
            'nv' : '单位净值',
            'anv': '累计净值',
            'header': 0}


# 天演产品模板 -1对应无效sheet
templete_tianyan = {'file_name' : '天演',
            'fund_id': [60, 629, 691, 694, -1], #  最后一个sheet是天演6号，提供的数据有问题暂不更新（有两栏单位净值但数据不同）
            'date' : 'Unnamed: 0',
            'nv' : '单位净值',
            'anv': '累计净值',
            'header': 1}
